zephyrproject-rtos/hal_gigadevice/include/dt-bindings/pinctrl/gd32vf103v(b-8)xx-pinctrl.h
/*
 * Autogenerated file
 *
 * SPDX-License-Identifier: Apache 2.0
 */

#include "gd32vf103xx-afio.h"

/* ADC01_IN0 */
#define ADC01_IN0_PA0 \
	GD32_PINMUX_AFIO('A', 0, ANALOG, NORMP)

/* ADC01_IN1 */
#define ADC01_IN1_PA1 \
	GD32_PINMUX_AFIO('A', 1, ANALOG, NORMP)

/* ADC01_IN10 */
#define ADC01_IN10_PC0 \
	GD32_PINMUX_AFIO('C', 0, ANALOG, NORMP)

/* ADC01_IN11 */
#define ADC01_IN11_PC1 \
	GD32_PINMUX_AFIO('C', 1, ANALOG, NORMP)

/* ADC01_IN12 */
#define ADC01_IN12_PC2 \
	GD32_PINMUX_AFIO('C', 2, ANALOG, NORMP)

/* ADC01_IN13 */
#define ADC01_IN13_PC3 \
	GD32_PINMUX_AFIO('C', 3, ANALOG, NORMP)

/* ADC01_IN14 */
#define ADC01_IN14_PC4 \
	GD32_PINMUX_AFIO('C', 4, ANALOG, NORMP)

/* ADC01_IN15 */
#define ADC01_IN15_PC5 \
	GD32_PINMUX_AFIO('C', 5, ANALOG, NORMP)

/* ADC01_IN2 */
#define ADC01_IN2_PA2 \
	GD32_PINMUX_AFIO('A', 2, ANALOG, NORMP)

/* ADC01_IN3 */
#define ADC01_IN3_PA3 \
	GD32_PINMUX_AFIO('A', 3, ANALOG, NORMP)

/* ADC01_IN4 */
#define ADC01_IN4_PA4 \
	GD32_PINMUX_AFIO('A', 4, ANALOG, NORMP)

/* ADC01_IN5 */
#define ADC01_IN5_PA5 \
	GD32_PINMUX_AFIO('A', 5, ANALOG, NORMP)

/* ADC01_IN6 */
#define ADC01_IN6_PA6 \
	GD32_PINMUX_AFIO('A', 6, ANALOG, NORMP)

/* ADC01_IN7 */
#define ADC01_IN7_PA7 \
	GD32_PINMUX_AFIO('A', 7, ANALOG, NORMP)

/* ADC01_IN8 */
#define ADC01_IN8_PB0 \
	GD32_PINMUX_AFIO('B', 0, ANALOG, NORMP)

/* ADC01_IN9 */
#define ADC01_IN9_PB1 \
	GD32_PINMUX_AFIO('B', 1, ANALOG, NORMP)

/* CAN0_RX */
#define CAN0_RX_PA11_NORMP \
	GD32_PINMUX_AFIO('A', 11, GPIO_IN, CAN0_NORMP)
#define CAN0_RX_PB8_PRMP \
	GD32_PINMUX_AFIO('B', 8, GPIO_IN, CAN0_PRMP)
#define CAN0_RX_PD0_FRMP \
	GD32_PINMUX_AFIO('D', 0, GPIO_IN, CAN0_FRMP)

/* CAN0_TX */
#define CAN0_TX_PA12_NORMP \
	GD32_PINMUX_AFIO('A', 12, ALTERNATE, CAN0_NORMP)
#define CAN0_TX_PB9_PRMP \
	GD32_PINMUX_AFIO('B', 9, ALTERNATE, CAN0_PRMP)
#define CAN0_TX_PD1_FRMP \
	GD32_PINMUX_AFIO('D', 1, ALTERNATE, CAN0_FRMP)

/* CAN1_RX */
#define CAN1_RX_PB12_NORMP \
	GD32_PINMUX_AFIO('B', 12, GPIO_IN, CAN1_NORMP)
#define CAN1_RX_PB5_RMP \
	GD32_PINMUX_AFIO('B', 5, GPIO_IN, CAN1_RMP)

/* CAN1_TX */
#define CAN1_TX_PB13_NORMP \
	GD32_PINMUX_AFIO('B', 13, ALTERNATE, CAN1_NORMP)
#define CAN1_TX_PB6_RMP \
	GD32_PINMUX_AFIO('B', 6, ALTERNATE, CAN1_RMP)

/* CK_OUT0 */
#define CK_OUT0_PA8 \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, NORMP)

/* DAC_OUT0 */
#define DAC_OUT0_PA4 \
	GD32_PINMUX_AFIO('A', 4, ANALOG, NORMP)

/* DAC_OUT1 */
#define DAC_OUT1_PA5 \
	GD32_PINMUX_AFIO('A', 5, ANALOG, NORMP)

/* EXMC_A16 */
#define EXMC_A16_PD11 \
	GD32_PINMUX_AFIO('D', 11, ALTERNATE, NORMP)

/* EXMC_A17 */
#define EXMC_A17_PD12 \
	GD32_PINMUX_AFIO('D', 12, ALTERNATE, NORMP)

/* EXMC_A18 */
#define EXMC_A18_PD13 \
	GD32_PINMUX_AFIO('D', 13, ALTERNATE, NORMP)

/* EXMC_A19 */
#define EXMC_A19_PE3 \
	GD32_PINMUX_AFIO('E', 3, ALTERNATE, NORMP)

/* EXMC_A20 */
#define EXMC_A20_PE4 \
	GD32_PINMUX_AFIO('E', 4, ALTERNATE, NORMP)

/* EXMC_A21 */
#define EXMC_A21_PE5 \
	GD32_PINMUX_AFIO('E', 5, ALTERNATE, NORMP)

/* EXMC_A22 */
#define EXMC_A22_PE6 \
	GD32_PINMUX_AFIO('E', 6, ALTERNATE, NORMP)

/* EXMC_A23 */
#define EXMC_A23_PE2 \
	GD32_PINMUX_AFIO('E', 2, ALTERNATE, NORMP)

/* EXMC_D0 */
#define EXMC_D0_PD14 \
	GD32_PINMUX_AFIO('D', 14, ALTERNATE, NORMP)

/* EXMC_D1 */
#define EXMC_D1_PD15 \
	GD32_PINMUX_AFIO('D', 15, ALTERNATE, NORMP)

/* EXMC_D10 */
#define EXMC_D10_PE13 \
	GD32_PINMUX_AFIO('E', 13, ALTERNATE, NORMP)

/* EXMC_D11 */
#define EXMC_D11_PE14 \
	GD32_PINMUX_AFIO('E', 14, ALTERNATE, NORMP)

/* EXMC_D12 */
#define EXMC_D12_PE15 \
	GD32_PINMUX_AFIO('E', 15, ALTERNATE, NORMP)

/* EXMC_D13 */
#define EXMC_D13_PD8 \
	GD32_PINMUX_AFIO('D', 8, ALTERNATE, NORMP)

/* EXMC_D14 */
#define EXMC_D14_PD9 \
	GD32_PINMUX_AFIO('D', 9, ALTERNATE, NORMP)

/* EXMC_D15 */
#define EXMC_D15_PD10 \
	GD32_PINMUX_AFIO('D', 10, ALTERNATE, NORMP)

/* EXMC_D2 */
#define EXMC_D2_PD0 \
	GD32_PINMUX_AFIO('D', 0, ALTERNATE, NORMP)

/* EXMC_D3 */
#define EXMC_D3_PD1 \
	GD32_PINMUX_AFIO('D', 1, ALTERNATE, NORMP)

/* EXMC_D4 */
#define EXMC_D4_PE7 \
	GD32_PINMUX_AFIO('E', 7, ALTERNATE, NORMP)

/* EXMC_D5 */
#define EXMC_D5_PE8 \
	GD32_PINMUX_AFIO('E', 8, ALTERNATE, NORMP)

/* EXMC_D6 */
#define EXMC_D6_PE9 \
	GD32_PINMUX_AFIO('E', 9, ALTERNATE, NORMP)

/* EXMC_D7 */
#define EXMC_D7_PE10 \
	GD32_PINMUX_AFIO('E', 10, ALTERNATE, NORMP)

/* EXMC_D8 */
#define EXMC_D8_PE11 \
	GD32_PINMUX_AFIO('E', 11, ALTERNATE, NORMP)

/* EXMC_D9 */
#define EXMC_D9_PE12 \
	GD32_PINMUX_AFIO('E', 12, ALTERNATE, NORMP)

/* EXMC_NBL0 */
#define EXMC_NBL0_PE0 \
	GD32_PINMUX_AFIO('E', 0, ALTERNATE, NORMP)

/* EXMC_NBL1 */
#define EXMC_NBL1_PE1 \
	GD32_PINMUX_AFIO('E', 1, ALTERNATE, NORMP)

/* EXMC_NE0 */
#define EXMC_NE0_PD7 \
	GD32_PINMUX_AFIO('D', 7, ALTERNATE, NORMP)

/* EXMC_NOE */
#define EXMC_NOE_PD4 \
	GD32_PINMUX_AFIO('D', 4, ALTERNATE, NORMP)

/* EXMC_NWAIT */
#define EXMC_NWAIT_PD6 \
	GD32_PINMUX_AFIO('D', 6, GPIO_IN, NORMP)

/* EXMC_NWE */
#define EXMC_NWE_PD5 \
	GD32_PINMUX_AFIO('D', 5, ALTERNATE, NORMP)

/* I2C0_SCL */
#define I2C0_SCL_PB6_NORMP \
	GD32_PINMUX_AFIO('B', 6, ALTERNATE, I2C0_NORMP)
#define I2C0_SCL_PB8_RMP \
	GD32_PINMUX_AFIO('B', 8, ALTERNATE, I2C0_RMP)

/* I2C0_SDA */
#define I2C0_SDA_PB7_NORMP \
	GD32_PINMUX_AFIO('B', 7, ALTERNATE, I2C0_NORMP)
#define I2C0_SDA_PB9_RMP \
	GD32_PINMUX_AFIO('B', 9, ALTERNATE, I2C0_RMP)

/* I2C0_SMBA */
#define I2C0_SMBA_PB5 \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, NORMP)

/* I2C1_SCL */
#define I2C1_SCL_PB10 \
	GD32_PINMUX_AFIO('B', 10, ALTERNATE, NORMP)

/* I2C1_SDA */
#define I2C1_SDA_PB11 \
	GD32_PINMUX_AFIO('B', 11, ALTERNATE, NORMP)

/* I2C1_SMBA */
#define I2C1_SMBA_PB12 \
	GD32_PINMUX_AFIO('B', 12, ALTERNATE, NORMP)

/* I2S1_CK */
#define I2S1_CK_PB13_INP \
	GD32_PINMUX_AFIO('B', 13, GPIO_IN, NORMP)
#define I2S1_CK_PB13_OUT \
	GD32_PINMUX_AFIO('B', 13, ALTERNATE, NORMP)

/* I2S1_MCK */
#define I2S1_MCK_PC6 \
	GD32_PINMUX_AFIO('C', 6, ALTERNATE, NORMP)

/* I2S1_SD */
#define I2S1_SD_PB15_INP \
	GD32_PINMUX_AFIO('B', 15, GPIO_IN, NORMP)
#define I2S1_SD_PB15_OUT \
	GD32_PINMUX_AFIO('B', 15, ALTERNATE, NORMP)

/* I2S1_WS */
#define I2S1_WS_PB12_INP \
	GD32_PINMUX_AFIO('B', 12, GPIO_IN, NORMP)
#define I2S1_WS_PB12_OUT \
	GD32_PINMUX_AFIO('B', 12, ALTERNATE, NORMP)

/* I2S2_CK */
#define I2S2_CK_PB3_INP_NORMP \
	GD32_PINMUX_AFIO('B', 3, GPIO_IN, I2S2_NORMP)
#define I2S2_CK_PB3_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, I2S2_NORMP)
#define I2S2_CK_PC10_INP_RMP \
	GD32_PINMUX_AFIO('C', 10, GPIO_IN, I2S2_RMP)
#define I2S2_CK_PC10_OUT_RMP \
	GD32_PINMUX_AFIO('C', 10, ALTERNATE, I2S2_RMP)

/* I2S2_MCK */
#define I2S2_MCK_PC7 \
	GD32_PINMUX_AFIO('C', 7, ALTERNATE, NORMP)

/* I2S2_SD */
#define I2S2_SD_PB5_INP_NORMP \
	GD32_PINMUX_AFIO('B', 5, GPIO_IN, I2S2_NORMP)
#define I2S2_SD_PB5_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, I2S2_NORMP)
#define I2S2_SD_PC12_INP_RMP \
	GD32_PINMUX_AFIO('C', 12, GPIO_IN, I2S2_RMP)
#define I2S2_SD_PC12_OUT_RMP \
	GD32_PINMUX_AFIO('C', 12, ALTERNATE, I2S2_RMP)

